## Plan Result (prod-global)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                         = "hmcts-prod"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/et-sya"
            name                = "et-sya"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ host_header = "et-sya.claim-employment-tribunals.service.gov.uk" -> "claim-employment-tribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }



      ~ frontend_endpoint {
          ~ host_name                               = "et-sya.claim-employment-tribunals.service.gov.uk" -> "claim-employment-tribunals.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/et-sya"
            name                                    = "et-sya"
            # (3 unchanged attributes hidden)
        }


        # (240 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fees-register"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/feesregisterprod"
        name                              = "feesregisterprod"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)


      ~ managed_rule {
            # (2 unchanged attributes hidden)

          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestCookieNames"
              ~ selector       = "rf" -> "fee-register-admin-web-cookie-preferences"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "DecodedUrl" -> "rf"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "QueryParamName" -> "DecodedUrl"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "DecodedPath" -> "QueryParamName"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "PostParamName" -> "DecodedPath"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "expression" -> "PostParamName"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "GroupName" -> "expression"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "NFuse_Application" -> "GroupName"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "banner_id" -> "NFuse_Application"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "callback" -> "banner_id"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
              ~ selector       = "reply_message_template" -> "callback"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "name" -> "reply_message_template"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestHeaderNames" -> "RequestBodyPostArgNames"
              ~ selector       = "User-Agent" -> "name"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "content-type" -> "User-Agent"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "RequestHeaderNames"
              ~ selector       = "csvFees" -> "content-type"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "description" -> "csvFees"
                # (2 unchanged attributes hidden)
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
            # (3 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1294,"Program":"tfcmt","SHA1":"","Target":"prod-global","Vars":{}} -->